Revit 2027 API
ExternalResourceReference Methods
The ExternalResourceReference type exposes the following members.
Methods
Name | Description
CreateLocalResource |  Creates an ExternalResourceReference representing a local file managed by Revit's built-in server.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetReferenceInformation |  Returns a copy of an object containing previously-stored reference or lookup information about the specific resource provided by the server.
GetResourceShortDisplayName |  Gets the short display name of the external resource.
GetResourceVersionStatus |  Checks whether this ExternalResourceReference corresponds to the current version of the resource.
GetType | Gets the Type of the current instance.
(Inherited from Object)
HasValidDisplayPath |  Checks whether this external Resource has a valid display path.
IsValidReference |  Checks whether the reference is in a valid format.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ExternalResourceReference Class
Autodesk.Revit.DB Namespace